Repository: csd4487/Vedema
Catalog: vedema/lib/l10n/app_*.arb
Languages: el

# welcomeText
source: Welcome to Vedema, the ultimate app for olive producers. Track your harvest, manage your expenses, and streamline your production process with ease.
el: Καλώς ήρθατε στη Vedema, την απόλυτη εφαρμογή για ελαιοπαραγωγούς. Παρακολουθήστε τη συγκομιδή σας, διαχειριστείτε τα έξοδά σας και βελτιστοποιήστε τη διαδικασία παραγωγής εύκολα.

source: Log In
el: Σύνδεση

source: Sign Up
el: Εγγραφή

source: Submit
el: Υποβολή

source: Select Language
el: Επιλέξτε Γλώσσα

# signUpTitle
source: Sign Up
el: Εγγραφή

# createAccount
source: Create your account
el: Εγγραφή

source: First Name
el: Όνομα

source: Last Name
el: Επώνυμο

source: Password
el: Κωδικός

source: Confirm Password
el: Επιβεβαίωση Κωδικού

# enterFirstName
source: Enter your first name
el: Εισάγετε το όνομά σας

# enterLastName
source: Enter your last name
el: Εισάγετε το επώνυμό σας

# enterEmail
source: Enter your email
el: Εισάγετε το email σας

# enterPassword
source: Enter your password
el: Εισάγετε τον κωδικό σας

# reEnterPassword
source: Re-Enter your password
el: Εισάγετε ξανά τον κωδικό σας

# fieldRequired
source: You need to fill this field.
el: Πρέπει να συμπληρώσετε αυτό το πεδίο.

# invalidEmail
source: Enter a valid email.
el: Εισάγετε ένα έγκυρο email.

# passwordsDontMatch
source: Passwords do not match.
el: Οι κωδικοί δεν ταιριάζουν.

# emailInUse
source: Email already in use
el: Το email χρησιμοποιείται ήδη

# alreadyHaveAccount
source: Already have an account?
el: Έχετε ήδη λογαριασμό;

# alreadyHaveAccountnot
source: You do not have an account?
el: Δεν έχετε λογαριασμό;

source: Log in
el: Σύνδεση

source: New Field
el: Νέο Χωράφι

source: Add your field
el: Νέο Χωράφι

# enterLocation
source: Enter your field location
el: Εισάγετε την τοποθεσία του χωραφιού

source: Field Size
el: Μέγεθος Χωραφιού

# enterFieldSize
source: Enter your field size
el: Εισάγετε το μέγεθος του χωραφιού

source: Olive Count
el: Αριθμός Ελαιοδέντρων

# enterOliveCount
source: Enter number of olive Trees
el: Εισάγετε τον αριθμό ελαιοδέντρων

source: Species
el: Ποικιλία

# enterSpecies
source: Enter olive species
el: Εισάγετε την ποικιλία ελιάς

source: Cubics
el: Κυβικά

# enterCubics
source: Enter cubics volume
el: Εισάγετε τον όγκο σε κυβικά

# enterPrice
source: Enter price per m³
el: Εισάγετε την τιμή ανά m³

source: Add Field
el: Προσθήκη Χωραφιού

# fieldAddedSuccess
source: Field added successfully
el: Το χωράφι προστέθηκε επιτυχώς

source: New Note
el: Νέα Σημείωση

source: Add New Note
el: Νέα Σημείωση

source: Note
el: Σημείωση

# enterNote
source: Enter your note
el: Εισάγετε τη σημείωσή σας

# selectDate
source: Select a date
el: Επιλέξτε ημερομηνία

source: Send Note in Email
el: Αποστολή σημείωσης μέσω email

# addNewNoteButton
source: Add New Note
el: Προσθήκη

# pleaseEnterNote
source: Please enter a note
el: Παρακαλώ εισάγετε μια σημείωση

# pleaseSelectDate
source: Please select a date
el: Παρακαλώ επιλέξτε ημερομηνία

source: Fields
el: Χωράφια

# oilSoldLabel
source: Oil sold
el: Λάδι που πουλήθηκε

# sacksSoldLabel
source: Sacks sold
el: Τσουβάλια που πουλήθηκαν

source: Expenses:
el: Έξοδα

source: Analytics
el: Αναλύσεις

# noFieldsHint
source: You do not have any fields yet, click the + button on the bottom right to add your fields
el: Δεν έχετε ακόμα χωράφια, πατήστε το κουμπί + κάτω δεξιά για να προσθέσετε

source: Confirm Deletion
el: Επιβεβαίωση Διαγραφής

# confirmDeleteField
source: Are you sure you want to delete this field?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το χωράφι;

source: Cancel
el: Ακύρωση

source: Yes
el: Ναι

source: Error loading fields
el: Αποτυχία φόρτωσης χωραφιών

# noNotesMessage
source: You do not have any notes yet, click the + button on the bottom right to add a note
el: Δεν έχετε ακόμα σημειώσεις, πατήστε το κουμπί + κάτω δεξιά για να προσθέσετε μια σημείωση

# failedToLoadNotes
source: Error loading notes
el: Αποτυχία φόρτωσης σημειώσεων

source: Error sending email
el: Αποτυχία αποστολής email

# deleteError
source: Error deleting
el: Σφάλμα διαγραφής

# deleteConfirmation
source: Are you sure you want to delete this note?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή τη σημείωση;

source: Note deleted
el: Η σημείωση διαγράφηκε

# failedToDelete
source: Failed to delete note
el: Αποτυχία διαγραφής σημείωσης

# emailSent
source: Email sent successfully
el: Το email στάλθηκε επιτυχώς

source: Failed to send email
el: Αποτυχία αποστολής email

source: Balance:
el: Υπόλοιπο:

source: Profits:
el: Έσοδα

source: Total Expenses:
el: Σύνολο Δαπανών:

source: Total Profits:
el: Σύνολο Κερδών:

source: Total Available Sacks:
el: Συνολικά διαθέσιμα τσουβάλια:

source: Total Available Oil:
el: Συνολικό διαθέσιμο λάδι:

source: Available sacks
el: Διαθέσιμα τσουβάλια

source: Available oil kg
el: Διαθέσιμο λάδι (κιλά)

source: Expense History
el: Ιστορικό Εξόδων

source: Profit History
el: Ιστορικό Κερδών

source: Show Less
el: Προβολή Λιγότερων

source: Show More
el: Προβολή Περισσότερων

# deleteExpenseConfirmation
source: Are you sure you want to delete this expense?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το έξοδο;

# deleteProfitConfirmation
source: Are you sure you want to delete this profit entry?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την καταχώρηση κέρδους;

source: Delete
el: Διαγραφή

source: Irrigation
el: Άρδευση

source: Fertilization
el: Λίπανση

source: Spraying
el: Ψεκασμός

source: Other
el: Άλλο

source: Sacks
el: Τσουβάλια

source: Grind
el: Άλεσμα

source: Sell
el: Πώληση

source: Failed to load field
el: Αποτυχία φόρτωσης χωραφιού

# failedToLoadSacks
source: Failed to load available sacks
el: Αποτυχία φόρτωσης διαθέσιμων τσουβαλιών

# failedToLoadOil
source: Failed to load available oil
el: Αποτυχία φόρτωσης διαθέσιμου λαδιού

# failedToLoadHistory
source: Failed to load profit history
el: Αποτυχία φόρτωσης ιστορικού κερδών

source: Failed to delete expense
el: Αποτυχία διαγραφής εξόδου

source: Failed to delete profit
el: Αποτυχία διαγραφής κέρδους

source: Error
el: Σφάλμα

source: Sale
el: Πώληση

# makeSale
source: Make a sale
el: Καταχώρηση πώλησης

# selectField
source: Select a field
el: Επιλέξτε χωράφι

source: Available oil
el: Διαθέσιμο λάδι

# oilToSell
source: Oil to sell (kg)
el: Λάδι προς πώληση (κιλά)

source: Price per kg (€)
el: Τιμή ανά κιλό (€)

# saleSuccess
source: Sale completed successfully!
el: Η πώληση ολοκληρώθηκε επιτυχώς!

# enterValue
source: Enter a value
el: Εισάγετε τιμή

# enterValidNumber
source: Enter a valid number
el: Εισάγετε έγκυρο αριθμό

# notEnoughOil
source: Not enough oil available
el: Δεν υπάρχει αρκετό διαθέσιμο λάδι

# enterValidPrice
source: Enter a valid price
el: Εισάγετε έγκυρη τιμή

# sellOil
source: Sell Oil from {fieldName}
el: Πώληση λαδιού από {fieldName}

source: kg
el: κιλά

# sacksToSell
source: Number of sacks to sell (1 sack = 16kg)
el: Αριθμός τσουβαλιών προς πώληση

# enterSacks
source: Enter number of sacks
el: Εισάγετε αριθμό τσουβαλιών

source: Price per sack (€)
el: Τιμή ανά σάκο (€)

source: Submit Sale
el: Καταχώρηση Πώλησης

source: Invalid input
el: Μη έγκυρη εισαγωγή

# invalidInputMessage
source: Please enter valid numbers for sacks and price.
el: Εισάγετε έγκυρους αριθμούς για τσουβάλια και τιμή.

source: Insufficient Oil
el: Ανεπαρκές λάδι

# insufficientOilMessage
source: You do not have enough oil to sell this amount.
el: Δεν έχετε αρκετό λάδι για να πουλήσετε αυτή την ποσότητα.

# saleRecorded
source: Sale recorded successfully!
el: Η πώληση καταχωρήθηκε επιτυχώς!

# newTaskAppBarTitle
source: New Task
el: Νέα Εργασία

source: Add new task
el: Προσθήκη νέας εργασίας

source: Task
el: Εργασία

# enterTaskName
source: Enter the task name
el: Εισάγετε το όνομα της εργασίας

source: Please enter task name
el: Παρακαλώ εισάγετε όνομα εργασίας

source: Cost
el: Κόστος

# enterCost
source: Enter the cost
el: Εισάγετε το κόστος

source: Please enter cost
el: Παρακαλώ εισάγετε κόστος

source: Synthesis
el: Σύνθεση

# enterSynthesis
source: Enter the synthesis
el: Εισάγετε τη σύνθεση

source: Please enter synthesis
el: Παρακαλώ εισάγετε σύνθεση

source: Type
el: Τύπος

# enterType
source: Enter the type
el: Εισάγετε τον τύπο

source: Please enter type
el: Παρακαλώ εισάγετε τύπο

# enterNpk
source: Enter the NPK value
el: Εισάγετε την τιμή NPK

source: Please enter NPK
el: Παρακαλώ εισάγετε τιμή NPK.

source: Notes
el: Σημειώσεις

# enterNotes
source: Enter any notes
el: Εισάγετε σημειώσεις

source: Add Task
el: Προσθήκη Εργασίας

source: Select a field
el: Επιλέξτε ένα χωράφι

source: Please select a field
el: Παρακαλώ επιλέξτε ένα χωράφι

# newTaskTitle
source: New Task
el: Νέα Εργασία

# taskLabel
source: Task
el: Εργασία

# enterTaskHint
source: Enter task name
el: Εισάγετε το όνομα της εργασίας

# taskValidation
source: Please enter task name
el: Παρακαλώ εισάγετε όνομα εργασίας

# dateLabel
source: Date
el: Ημερομηνία

# selectDateHint
source: Select a date
el: Επιλέξτε ημερομηνία

# dateValidation
source: Please select a date
el: Παρακαλώ επιλέξτε ημερομηνία

# costLabel
source: Cost (€)
el: Κόστος (€)

# enterCostHint
source: Enter cost
el: Εισάγετε το κόστος

# costValidation
source: Please enter cost
el: Παρακαλώ εισάγετε κόστος

# synthesisLabel
source: Synthesis
el: Σύνθεση

# enterSynthesisHint
source: Enter synthesis
el: Εισάγετε σύνθεση

# synthesisValidation
source: Please enter synthesis
el: Παρακαλώ εισάγετε σύνθεση

# typeLabel
source: Type
el: Τύπος

# enterTypeHint
source: Enter type
el: Εισάγετε τύπο

# typeValidation
source: Please enter type
el: Παρακαλώ εισάγετε τύπο

# enterNpkHint
source: Enter NPK value
el: Εισάγετε τιμή NPK

# npkValidation
source: Please enter NPK
el: Παρακαλώ εισάγετε NPK

# notesLabel
source: Notes
el: Σημειώσεις

# enterNotesHint
source: Enter notes
el: Εισάγετε σημειώσεις

# addTaskButton
source: Add Task
el: Προσθήκη Εργασίας

source: All Fields Summary
el: Όλα τα χωράφια

source: All Expenses History
el: Ιστορικό Όλων των Εξόδων

source: General
el: Γενικά

source: Filter Analytics
el: Φίλτρο Αναλύσεων

source: Select Period
el: Επιλέξτε Περίοδο

source: Select Fields
el: Επιλέξτε Χωράφια

source: Select All
el: Επιλογή Όλων

source: Deselect All
el: Αποεπιλογή Όλων

source: View Type
el: Τύπος

source: Both
el: Και τα δύο

source: Select Tasks
el: Επιλέξτε Εργασίες

source: Chart Type
el: Τύπος Διαγράμματος

source: Apply
el: Εφαρμογή

source: Other Expenses
el: Άλλα Έξοδα

source: Update Field
el: Ενημέρωση Χωραφιού

source: Update your field
el: Ενημέρωση

source: Location
el: Τοποθεσία

# locationUneditable
source: Location cannot be changed
el: Η τοποθεσία δεν μπορεί να αλλάξει

source: Price
el: Τιμή

source: Add Sacks
el: Προσθήκη

source: Grind sacks
el: Άλεσμα τσουβάλια

# numSacksGrind
source: Number of sacks to grind
el: Αριθμός τσουβαλιών για άλεση

# notEnoughSacks
source: Not enough sacks available
el: Δεν υπάρχουν αρκετά διαθέσιμα τσουβάλια

source: Date
el: Ημερομηνία

# selectDateValidation
source: Please select a date
el: Παρακαλώ επιλέξτε ημερομηνία

# oilKg
source: Kilograms of oil produced
el: Κιλά παραγόμενου λαδιού

# sacksGrindSuccess
source: Sacks ground successfully!
el: Η άλεση των τσουβαλιών ήταν επιτυχής!

# sacksAddSuccess
source: Sacks added successfully!
el: Τα τσουβάλια προστέθηκαν επιτυχώς!

# selectFieldValidation
source: Please select a field
el: Παρακαλώ επιλέξτε χωράφι

# numSacksAdd
source: Number of sacks to add
el: Αριθμός τσουβαλιών για προσθήκη

# validNumber
source: Enter a valid number
el: Εισάγετε έγκυρο αριθμό

source: Pie Chart
el: Κυκλικό Διάγραμμα

source: Bar Chart
el: Ραβδόγραμμα

source: Line Chart
el: Γραμμικό Διάγραμμα

source: Doughnut Chart
el: Διάγραμμα Δακτυλίου

source: Failed to load analytics data
el: Αποτυχία φόρτωσης αναλυτικών δεδομένων

source: Error loading data
el: Σφάλμα φόρτωσης δεδομένων

# storagePermissionRequired
source: Storage permission is required to save the file
el: Απαιτείται άδεια αποθήκευσης για την αποθήκευση του αρχείου

source: Export
el: Εξαγωγή

source: Filters
el: Φίλτρα

source: Export as PDF
el: Εξαγωγή σε PDF

source: Export as Excel
el: Εξαγωγή σε Excel

source: Could not find downloads directory
el: Δεν ήταν δυνατή η εύρεση του φακέλου λήψεων

source: Excel exported to
el: Το Excel εξήχθη σε

# failedToOpenExcelFile
source: Failed to open the Excel file
el: Αποτυχία ανοίγματος του αρχείου Excel

source: Amount
el: Ποσό

source: Expense Categories
el: Κατηγορίες Δαπανών

source: Expense Breakdown
el: Ανάλυση Δαπανών

source: Detailed Expenses by Field
el: Αναλυτικές Δαπάνες ανά χωράφι

source: Profit Categories
el: Κατηγορίες Κερδών

# oilSold
source: Oil Sold: {amount} kg
el: Ελαιόλαδο που πουλήθηκε: {amount} κιλά

# sacksSold
source: Sacks Sold: {amount}
el: Πωληθέντα τσουβάλια: {amount}

source: Other Profits:
el: Άλλα Κέρδη:

source: Total:
el: Σύνολο:

source: Detailed Profits by Field
el: Αναλυτικά Κέρδη ανά χωράφι

source: Summary
el: Σύνοψη

source: Net Balance
el: Καθαρό Υπόλοιπο

source: No fields
el: Κανένα χωράφι

# noDataAvailable
source: No {type} data available
el: Δεν υπάρχουν διαθέσιμα δεδομένα για {type}

source: Oil Sales
el: Πωλήσεις Λαδιού

# enterValidPositiveNumber
source: Enter a valid positive number
el: Εισάγετε έναν έγκυρο θετικό αριθμό

# sacksExceedAvailable
source: Not enough sacks available
el: Δεν υπάρχουν αρκετά διαθέσιμα τσουβάλια

# enterKgOfOil
source: Enter kilograms of oil
el: Εισάγετε κιλά λαδιού

source: Please select a date
el: Παρακαλώ επιλέξτε ημερομηνία

source: Number of sacks to grind
el: Αριθμός τσουβαλιών για άλεσμα

source: Number of sacks to add
el: Αριθμός τσουβαλιών για προσθήκη

source: Enter number of sacks
el: Εισάγετε αριθμό τσουβαλιών

source: Kg of oil obtained
el: Κιλά λαδιού που παραλήφθηκαν

source: Sacks added successfully
el: Τα τσουβάλια προστέθηκαν επιτυχώς!

source: Failed to fetch available sacks
el: Αποτυχία φόρτωσης διαθέσιμων τσουβαλιών

source: Failed to load fields
el: Αποτυχία φόρτωσης χωραφιών

# sacksGroundSuccessfully
source: Sacks were grounded Successfully
el: Τα τσουβάλια αλέστηκαν επιτυχώς

# newOtherProfit
source: New Profit
el: Νέο Κέρδος

source: Add new profit
el: Προσθήκη νέου κέρδους

# incomeLabel
source: Income
el: Έσοδα

# enterIncomeHint
source: Enter income amount
el: Εισάγετε ποσό εσόδου

# incomeValidation
source: Please enter income
el: Παρακαλώ εισάγετε έσοδα

# addProfitButton
source: Add Profit
el: Προσθήκη Κέρδους

source: Error fetching sacks
el: Σφάλμα κατά την ανάκτηση τσουβαλιών

source: Error fetching oil
el: Σφάλμα κατά την ανάκτηση λαδιού

# failedToLoadProfits
source: Failed to load profit history
el: Αποτυχία φόρτωσης ιστορικού εσόδων

# errorFetchingProfits
source: Error fetching history
el: Σφάλμα κατά την ανάκτηση ιστορικού

# confirmDeleteExpensePrompt
source: Are you sure you want to delete this expense?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το έξοδο;

source: Error deleting expense
el: Σφάλμα κατά τη διαγραφή εξόδου

# confirmDeleteProfitPrompt
source: Are you sure you want to delete this profit entry?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την καταγραφή εσόδου;

source: Error deleting profit
el: Σφάλμα κατά τη διαγραφή εσόδου

source: sold for
el: πωλήθηκε για

source: Microphone permission denied
el: Η πρόσβαση στο μικρόφωνο απορρίφθηκε

# speechError
source: Speech error: {error}
el: Σφάλμα φωνητικής εισόδου: {error}

source: Speech not available
el: Η φωνητική εισαγωγή δεν είναι διαθέσιμη

# voiceAddNote
source: add new note
el: προσθήκη σημείωσης

# voiceNotes
source: notes
el: σημειώσεις

# noFieldMatch
source: No matching field found for: {command}
el: Δεν βρέθηκε αντίστοιχο χωράφι: {command}

source: Failed to fetch fields
el: Αποτυχία ανάκτησης χωραφιού

# errorOccurred
source: Error: {message}
el: Σφάλμα: {message}

source: Language
el: Γλώσσα

source: Logout
el: Αποσύνδεση

# chooseLanguage
source: Choose your language
el: Επιλέξτε γλώσσα

# failedToOpenExcel
source: Failed to open the Excel file
el: Αποτυχία ανοίγματος του αρχείου Excel

# downloadsDirectoryNotFound
source: Could not find downloads directory
el: Δεν βρέθηκε ο φάκελος λήψεων

# failedToLoadAnalytics
source: Failed to load analytics data
el: Αποτυχία φόρτωσης αναλύσεων

# errorLoadingAnalytics
source: Error loading analytics data: {error}
el: Σφάλμα κατά τη φόρτωση αναλύσεων: {error}

# season
source: Season: {period}
el: Περίοδος: {period}

source: Expenses Analysis
el: Ανάλυση Δαπανών

source: Profits Analysis
el: Ανάλυση Κερδών

source: Category
el: Κατηγορία

# fieldWithMostExpenses
source: Field with most expenses: {field}
el: Χωράφι με τα περισσότερα έξοδα: {field}

# fieldWithMostProfits
source: Field with most profits: {field}
el: Χωράφι με τα περισσότερα έσοδα: {field}

source: Detailed Expenses
el: Αναλυτικά Έξοδα

source: Detailed Profits
el: Αναλυτικά Έσοδα

# exportPdf
source: Export as PDF
el: Εξαγωγή σε PDF

# exportExcel
source: Export as Excel
el: Εξαγωγή σε Excel

source: New Task
el: Νέα Εργασία

source: Field
el: Χωράφι

# fieldValidation
source: Please select a field
el: Παρακαλώ επιλέξτε χωράφι

source: Error fetching fields
el: Σφάλμα κατά τη φόρτωση χωραφιών
